<template>
  <div id="app">
    <div class="headr">
      <a href="https://github.com/zhangzhengyi12/vue-scrollbars" aria-label="View source on Github" class="github-corner">
        <svg
          width="80"
          height="80"
          viewBox="0 0 250 250"
          aria-hidden="true"
          style="fill: rgb(79, 192, 141); color: rgb(44, 62, 80); position: absolute; top: 0px; border: 0px; right: 0px;"
        >
          <path d="M0,0 L115,115 L130,115 L142,142 L250,250 L250,0 Z"></path>
          <path
            d="M128.3,109.0 C113.8,99.7 119.0,89.6 119.0,89.6 C122.0,82.7 120.5,78.6 120.5,78.6 C119.2,72.0 123.4,76.3 123.4,76.3 C127.3,80.9 125.5,87.3 125.5,87.3 C122.9,97.6 130.6,101.9 134.4,103.2"
            fill="currentColor"
            class="octo-arm"
            style="transform-origin: 130px 106px 0px;"
          ></path>
          <path
            d="M115.0,115.0 C114.9,115.1 118.7,116.5 119.8,115.4 L133.7,101.6 C136.9,99.2 139.9,98.4 142.2,98.6 C133.8,88.0 127.5,74.4 143.8,58.0 C148.5,53.4 154.0,51.2 159.7,51.0 C160.3,49.4 163.2,43.6 171.4,40.1 C171.4,40.1 176.1,42.5 178.8,56.2 C183.1,58.6 187.2,61.8 190.9,65.4 C194.5,69.0 197.7,73.2 200.1,77.6 C213.8,80.2 216.3,84.9 216.3,84.9 C212.7,93.1 206.9,96.0 205.4,96.6 C205.1,102.4 203.0,107.8 198.3,112.5 C181.9,128.9 168.3,122.5 157.7,114.1 C157.9,116.9 156.7,120.9 152.7,124.9 L141.0,136.5 C139.8,137.7 141.6,141.9 141.8,141.8 Z"
            fill="currentColor"
            class="octo-body"
          ></path>
        </svg>
      </a>
    </div>
    <h1 class="title">Vue-Scrollbars</h1>
    <div class="hor demo">
      <h2 class="title">Horizontal scrolling</h2>
      <scrollbars style="height:200px;width:90vw;margin:0 auto">
        <div class="inner" style="width:300vw;height:200px">
          当初他们告诉我要说点大话
          努力地秀优越和所有人都不一样
          从头到脚武装到大
          玩到了三四点不给家里电话
          说话就像某个纽约老大
          你拿出那些烂东西给榜单投稿
          在人云亦云中再骂着别人娘炮
          你陷落 没度过 源源不断的培育这些蠢货
          历史继续的重演他们开始越来越多
          任这些所谓的HipHop精神被传染
          你觉得被小瞧 却不敢越标线
          做只被困的小鸟 被说唱给洗脑
          三脚猫的功夫 来拿梦想做消遣
          你都没有声卡 你都没麦克风
          也许你真心热爱然后来糊弄听众
          任何有实力的Rapper都不是一天练成
          你以为随便发点垃圾就能随便糊弄人 Bitch
          现在中文说唱如此怪异
          因为你们这些傻逼彻底毁掉了它的定义
          你当然不懂音乐性 只想表现自己多恶棍
          流行歌曲都是垃圾哪来的谬论 到处都是这些抵制者
          Oldskool 更重要是 Peace love reppect
          撒**的钱你只会吃不上饭
          贪官会拿着你的钱在新西兰过圣诞 可是你根本不配听
          所以这是代表中国说唱 第六代
          我得到所有前人启发一夜自我成才
          不管你变得多么腐败至少我还在
          把它装进了专辑我只诉说社会百态
          你是否觉得MotherFuck HipHop is dead ，Bitch
          我就是最后剩下的一张王牌 这首也献给已经泛滥的第六代
          我会灭了你们然后走上我的舞台
          没有所谓的明星至少在这个圈子
          被环境所牵制被媒体和主流风向标牵着走
          先到先得手不做人偏做狗拼的光靠手速
          真正懂的人都在家一个人喝着酒
          为什么不能抽道理都说不通
          你们骗炮*着妞的时候 我在一边写词一边roll
          独立的飞行搭配单调的背景麦克磨锐利
          装装装你**你知道什么叫做Flow
          四年的时间足够
          等待出头时该出手
          笔头演奏的梦承受各种压力
          渗透肌肉的痛早就没了重力
          控制动力来源于我对自由的放大
          打破界限黑夜才能看得见繁星
          听见我的话第六代中国MC
          沉默是金聆听冷静的心切忌别信宿命 这一切靠命去拼
          短暂压制像影响发育的快餐垃圾
          HipHop的光被装进这隧道
          谁能进入深不见底去挖掘它
          释放真相对抗笑里藏着刀被告
          若无其事嬉笑
          人民币标记号
          第六代做番号
          谋杀你们做成切糕
          响尾蛇导弹一样追踪无处跑
          移开掉没诚意的货感受这终极版加农炮
          所以这是代表中国说唱 第六代
          我得到所有前人启发一夜自我成才
          不管你变得多么腐败至少我还在
          把它装进了专辑我只诉说社会百态
          你是否觉得MotherFuck HipHop is dead ，Bitch
          我就是最后剩下的一张王牌 这首也献给已经泛滥的第六代
          我会灭了你们然后走上我的舞台
          保持道法自然与世无争 心始终都存留着一片净土
          远离谩骂和攻击 而真正的国王在加冕前都习惯被放逐
          都想得到天下 但天下太大又小得可怕
          所以我把皇冠给摘下让随心所欲的自由去代替了讨伐
          就让我把山川踏成土坡 饮下狂风骤雨当成酒喝
          心里装得下江河湖泊都一笑而过 I'm hustle like Rambo
          别管有谁一直都在diss你 而你又想diss谁
          谁在背后开枪失陪 窝囊废说唱的贼 我还在等着你的一番作为
          别再亲手引爆你昨天埋下的雷 OK
          不管你确定属于第几代
          无所谓选择好你的位置
          醒或是醉保持无畏 让作品来证明着用进废退
          谁的作品怎么样都与谁无关
          但是我只知道修心远征 歧路漫漫
          I'm new power/ new god/ new flow/ And new Level.
          所以这是代表中国说唱 第六代
          我得到所有前人启发一夜自我成才
          不管你变得多么腐败至少我还在
          把它装进了专辑我只诉说社会百态
          你是否觉得MotherFuck HipHop is dead ，Bitch
          我就是最后剩下的一张王牌 这首也献给已经泛滥的第六代
          我会灭了你们然后走上我的舞台
        </div>
      </scrollbars>
    </div>
    <div class="hor demo">
      <h2 class="title">Vertical scrolling autoHide</h2>
      <scrollbars style="height:200px;width:90vw;margin:0 auto" autoHide :listenScrollBottom="toBotHandle">
        <div class="inner" style="width:90vw;height:1000px">
          当初他们告诉我要说点大话
          努力地秀优越和所有人都不一样
          从头到脚武装到大
          玩到了三四点不给家里电话
          说话就像某个纽约老大
          你拿出那些烂东西给榜单投稿
          在人云亦云中再骂着别人娘炮
          你陷落 没度过 源源不断的培育这些蠢货
          历史继续的重演他们开始越来越多
          任这些所谓的HipHop精神被传染
          你觉得被小瞧 却不敢越标线
          做只被困的小鸟 被说唱给洗脑
          三脚猫的功夫 来拿梦想做消遣
          你都没有声卡 你都没麦克风
          也许你真心热爱然后来糊弄听众
          任何有实力的Rapper都不是一天练成
          你以为随便发点垃圾就能随便糊弄人 Bitch
          现在中文说唱如此怪异
          因为你们这些傻逼彻底毁掉了它的定义
          你当然不懂音乐性 只想表现自己多恶棍
          流行歌曲都是垃圾哪来的谬论 到处都是这些抵制者
          Oldskool 更重要是 Peace love reppect
          撒**的钱你只会吃不上饭
          贪官会拿着你的钱在新西兰过圣诞 可是你根本不配听
          所以这是代表中国说唱 第六代
          我得到所有前人启发一夜自我成才
          不管你变得多么腐败至少我还在
          把它装进了专辑我只诉说社会百态
          你是否觉得MotherFuck HipHop is dead ，Bitch
          我就是最后剩下的一张王牌 这首也献给已经泛滥的第六代
          我会灭了你们然后走上我的舞台
          没有所谓的明星至少在这个圈子
          被环境所牵制被媒体和主流风向标牵着走
          先到先得手不做人偏做狗拼的光靠手速
          真正懂的人都在家一个人喝着酒
          为什么不能抽道理都说不通
          你们骗炮*着妞的时候 我在一边写词一边roll
          独立的飞行搭配单调的背景麦克磨锐利
          装装装你**你知道什么叫做Flow
          四年的时间足够
          等待出头时该出手
          笔头演奏的梦承受各种压力
          渗透肌肉的痛早就没了重力
          控制动力来源于我对自由的放大
          打破界限黑夜才能看得见繁星
          听见我的话第六代中国MC
          沉默是金聆听冷静的心切忌别信宿命 这一切靠命去拼
          短暂压制像影响发育的快餐垃圾
          HipHop的光被装进这隧道
          谁能进入深不见底去挖掘它
          释放真相对抗笑里藏着刀被告
          若无其事嬉笑
          人民币标记号
          第六代做番号
          谋杀你们做成切糕
          响尾蛇导弹一样追踪无处跑
          移开掉没诚意的货感受这终极版加农炮
          所以这是代表中国说唱 第六代
          我得到所有前人启发一夜自我成才
          不管你变得多么腐败至少我还在
          把它装进了专辑我只诉说社会百态
          你是否觉得MotherFuck HipHop is dead ，Bitch
          我就是最后剩下的一张王牌 这首也献给已经泛滥的第六代
          我会灭了你们然后走上我的舞台
          保持道法自然与世无争 心始终都存留着一片净土
          远离谩骂和攻击 而真正的国王在加冕前都习惯被放逐
          都想得到天下 但天下太大又小得可怕
          所以我把皇冠给摘下让随心所欲的自由去代替了讨伐
          就让我把山川踏成土坡 饮下狂风骤雨当成酒喝
          心里装得下江河湖泊都一笑而过 I'm hustle like Rambo
          别管有谁一直都在diss你 而你又想diss谁
          谁在背后开枪失陪 窝囊废说唱的贼 我还在等着你的一番作为
          别再亲手引爆你昨天埋下的雷 OK
          不管你确定属于第几代
          无所谓选择好你的位置
          醒或是醉保持无畏 让作品来证明着用进废退
          谁的作品怎么样都与谁无关
          但是我只知道修心远征 歧路漫漫
          I'm new power/ new god/ new flow/ And new Level.
          所以这是代表中国说唱 第六代
          我得到所有前人启发一夜自我成才
          不管你变得多么腐败至少我还在
          把它装进了专辑我只诉说社会百态
          你是否觉得MotherFuck HipHop is dead ，Bitch
          我就是最后剩下的一张王牌 这首也献给已经泛滥的第六代
          我会灭了你们然后走上我的舞台
        </div>
      </scrollbars>
    </div>
    <div class="free demo">
      <h2 class="title">Free scrolling autoHide</h2>
      <scrollbars style="height:200px;width:90vw;margin:0 auto" autoHide>
        <div class="inner" style="width:300vw;height:1000px">
          当初他们告诉我要说点大话
          努力地秀优越和所有人都不一样
          从头到脚武装到大
          玩到了三四点不给家里电话
          说话就像某个纽约老大
          你拿出那些烂东西给榜单投稿
          在人云亦云中再骂着别人娘炮
          你陷落 没度过 源源不断的培育这些蠢货
          历史继续的重演他们开始越来越多
          任这些所谓的HipHop精神被传染
          你觉得被小瞧 却不敢越标线
          做只被困的小鸟 被说唱给洗脑
          三脚猫的功夫 来拿梦想做消遣
          你都没有声卡 你都没麦克风
          也许你真心热爱然后来糊弄听众
          任何有实力的Rapper都不是一天练成
          你以为随便发点垃圾就能随便糊弄人 Bitch
          现在中文说唱如此怪异
          因为你们这些傻逼彻底毁掉了它的定义
          你当然不懂音乐性 只想表现自己多恶棍
          流行歌曲都是垃圾哪来的谬论 到处都是这些抵制者
          Oldskool 更重要是 Peace love reppect
          撒**的钱你只会吃不上饭
          贪官会拿着你的钱在新西兰过圣诞 可是你根本不配听
          所以这是代表中国说唱 第六代
          我得到所有前人启发一夜自我成才
          不管你变得多么腐败至少我还在
          把它装进了专辑我只诉说社会百态
          你是否觉得MotherFuck HipHop is dead ，Bitch
          我就是最后剩下的一张王牌 这首也献给已经泛滥的第六代
          我会灭了你们然后走上我的舞台
          没有所谓的明星至少在这个圈子
          被环境所牵制被媒体和主流风向标牵着走
          先到先得手不做人偏做狗拼的光靠手速
          真正懂的人都在家一个人喝着酒
          为什么不能抽道理都说不通
          你们骗炮*着妞的时候 我在一边写词一边roll
          独立的飞行搭配单调的背景麦克磨锐利
          装装装你**你知道什么叫做Flow
          四年的时间足够
          等待出头时该出手
          笔头演奏的梦承受各种压力
          渗透肌肉的痛早就没了重力
          控制动力来源于我对自由的放大
          打破界限黑夜才能看得见繁星
          听见我的话第六代中国MC
          沉默是金聆听冷静的心切忌别信宿命 这一切靠命去拼
          短暂压制像影响发育的快餐垃圾
          HipHop的光被装进这隧道
          谁能进入深不见底去挖掘它
          释放真相对抗笑里藏着刀被告
          若无其事嬉笑
          人民币标记号
          第六代做番号
          谋杀你们做成切糕
          响尾蛇导弹一样追踪无处跑
          移开掉没诚意的货感受这终极版加农炮
          所以这是代表中国说唱 第六代
          我得到所有前人启发一夜自我成才
          不管你变得多么腐败至少我还在
          把它装进了专辑我只诉说社会百态
          你是否觉得MotherFuck HipHop is dead ，Bitch
          我就是最后剩下的一张王牌 这首也献给已经泛滥的第六代
          我会灭了你们然后走上我的舞台
          保持道法自然与世无争 心始终都存留着一片净土
          远离谩骂和攻击 而真正的国王在加冕前都习惯被放逐
          都想得到天下 但天下太大又小得可怕
          所以我把皇冠给摘下让随心所欲的自由去代替了讨伐
          就让我把山川踏成土坡 饮下狂风骤雨当成酒喝
          心里装得下江河湖泊都一笑而过 I'm hustle like Rambo
          别管有谁一直都在diss你 而你又想diss谁
          谁在背后开枪失陪 窝囊废说唱的贼 我还在等着你的一番作为
          别再亲手引爆你昨天埋下的雷 OK
          不管你确定属于第几代
          无所谓选择好你的位置
          醒或是醉保持无畏 让作品来证明着用进废退
          谁的作品怎么样都与谁无关
          但是我只知道修心远征 歧路漫漫
          I'm new power/ new god/ new flow/ And new Level.
          所以这是代表中国说唱 第六代
          我得到所有前人启发一夜自我成才
          不管你变得多么腐败至少我还在
          把它装进了专辑我只诉说社会百态
          你是否觉得MotherFuck HipHop is dead ，Bitch
          我就是最后剩下的一张王牌 这首也献给已经泛滥的第六代
          我会灭了你们然后走上我的舞台
        </div>
      </scrollbars>
    </div>
  </div>
</template>

<script>
import Scrollbars from "./components/scrollbars";
export default {
  name: "app",
  components: {
    Scrollbars
  },
  methods: {
    toBotHandle(h) {
      alert("to bottom");
    }
  }
};
</script>

<style>
#app {
  font-family: "Avenir", Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
  margin-top: 60px;
}

h1,
h2 {
  font-weight: normal;
}

ul {
  list-style-type: none;
  padding: 0;
}

li {
  display: inline-block;
  margin: 0 10px;
}

a {
  color: #42b983;
}

.inner {
  background-color: #ccc;
  color: #fff;
}
</style>
